
// Created by Robert John Anderson on 2020-01-10.
//

#ifndef M7_UTILS_H
#define M7_UTILS_H

#include <M7_lib/defs.h>
#include <vector>
#include <array>
#include <stack>
#include <complex>
#include <iostream>
#include <cmath>
#include <limits>
#include <numeric>
#include <x86intrin.h>
#include <climits>
#include <iomanip>
#include <cstring>
#include <algorithm>
#include <memory>
#include <functional>
#include <list>

namespace utils {

    static constexpr size_t min(size_t i, size_t j) {
        return i < j ? i : j;
    }

    static constexpr size_t max(size_t i, size_t j) {
        return i > j ? i : j;
    }

    /*
     * tests whether all bytes are zero.
     * This is slow, only use for checking that memsets and other zeroing operations
     * have been successful in debug build
     */
    template<typename T>
    static bool is_zero(const T *v) {
        for (size_t ichar = 0ul; ichar < sizeof(T); ++ichar) {
            if (reinterpret_cast<char *>(v)[ichar] != 0) return false;
        }
        return true;
    }

    template<typename T>
    static bool is_zero(const T &v) {
        return is_zero(&v);
    }

    /**
     * catch-all for non-arithmetic types attempts to use output stream << overload. If it doesn't exist, compile time
     * error will be raised
     * @tparam T
     *  type of data to represent as a string
     * @param v
     *  value to represent as string
     * @return
     *  string representation of v
     */
    template<typename T>

    size_t combinatorial(const size_t &n, const size_t &r);

    size_t combinatorial_with_repetition(const size_t &n, const size_t &r);

    /**
     * exact integer power by recursive squaring
     * @tparam T
     *  integer type
     * @param x
     *  number being exponentiated
     * @param y
     *  exponent
     * @return
     *  x to the power y
     */
    template<typename T>
    T pow(T x, T y){
        static_assert(std::is_integral<T>::value, "template arg must be integral type");
        if (!y) return 1;
        if (y == 1) return x;

        auto tmp = pow(x, y / 2);
        if (y & T(1)) return x * tmp * tmp;
        return tmp * tmp;
    }
}

namespace bit_utils {

    /**
     * masks whose ith elements retain i bits when bitwise and-ed with another value of the same size (4 or 8 bytes)
     */
    static constexpr std::array<uint8_t, 9> c_trunc_mask_8 =
            {0x0, 0x1, 0x3, 0x7, 0xf, 0x1f, 0x3f, 0x7f, 0xff};
    static constexpr std::array<uint16_t, 17> c_trunc_mask_16 =
            {0x0, 0x1, 0x3, 0x7, 0xf, 0x1f, 0x3f, 0x7f, 0xff, 0x1ff, 0x3ff,
             0x7ff, 0xfff, 0x1fff, 0x3fff, 0x7fff, 0xffff};
    static constexpr std::array<uint32_t, 33> c_trunc_mask_32 =
            {0x0, 0x1, 0x3, 0x7, 0xf, 0x1f, 0x3f, 0x7f, 0xff, 0x1ff, 0x3ff,
             0x7ff, 0xfff, 0x1fff, 0x3fff, 0x7fff, 0xffff, 0x1ffff, 0x3ffff,
             0x7ffff, 0xfffff, 0x1fffff, 0x3fffff, 0x7fffff, 0xffffff,
             0x1ffffff, 0x3ffffff, 0x7ffffff, 0xfffffff, 0x1fffffff,
             0x3fffffff, 0x7fffffff, 0xffffffff};
    static constexpr std::array<uint64_t, 65> c_trunc_mask_64 =
            {0x0, 0x1, 0x3, 0x7, 0xf, 0x1f, 0x3f, 0x7f, 0xff, 0x1ff, 0x3ff,
             0x7ff, 0xfff, 0x1fff, 0x3fff, 0x7fff, 0xffff, 0x1ffff,
             0x3ffff, 0x7ffff, 0xfffff, 0x1fffff, 0x3fffff, 0x7fffff,
             0xffffff, 0x1ffffff, 0x3ffffff, 0x7ffffff, 0xfffffff,
             0x1fffffff, 0x3fffffff, 0x7fffffff, 0xffffffff, 0x1ffffffff,
             0x3ffffffff, 0x7ffffffff, 0xfffffffff, 0x1fffffffff,
             0x3fffffffff, 0x7fffffffff, 0xffffffffff, 0x1ffffffffff,
             0x3ffffffffff, 0x7ffffffffff, 0xfffffffffff, 0x1fffffffffff,
             0x3fffffffffff, 0x7fffffffffff, 0xffffffffffff,
             0x1ffffffffffff, 0x3ffffffffffff, 0x7ffffffffffff,
             0xfffffffffffff, 0x1fffffffffffff, 0x3fffffffffffff,
             0x7fffffffffffff, 0xffffffffffffff, 0x1ffffffffffffff,
             0x3ffffffffffffff, 0x7ffffffffffffff, 0xfffffffffffffff,
             0x1fffffffffffffff, 0x3fffffffffffffff, 0x7fffffffffffffff,
             0xffffffffffffffff};

    template<typename T>
    static inline void clr(T &x, const size_t &i) {
        x &= ~(T(1) << T(i));
    }

    template<typename T>
    static inline void set(T &x, const size_t &i) {
        x |= (T(1) << T(i));
    }

    template<typename T>
    static inline bool get(const T &x, const size_t &i) {
        return x & (T(1) << T(i));
    }

    inline size_t next_setbit(unsigned long long &work) {
        static_assert(sizeof(work) == 8, "Data length not supported");
        size_t result = __tzcnt_u64(work);
        bit_utils::clr(work, result);
        return result;
    }

    inline size_t next_setbit(unsigned long &work) {
        static_assert(sizeof(work) == 8, "Data length not supported");
        size_t result = __tzcnt_u64(work);
        bit_utils::clr(work, result);
        return result;
    }

    inline size_t next_setbit(unsigned &work) {
        static_assert(sizeof(work) == 4, "Data length not supported");
        size_t result = __tzcnt_u32(work);
        bit_utils::clr(work, result);
        return result;
    }

    inline size_t nsetbit(const unsigned long long &work) {
        static_assert(sizeof(work) == 8, "Data length not supported");
        return _popcnt64(work);
    }

    inline size_t nsetbit(const unsigned long &work) {
        static_assert(sizeof(work) == 8, "Data length not supported");
        return _popcnt64(work);
    }

    inline size_t nsetbit(const unsigned &work) {
        static_assert(sizeof(work) == 4, "Data length not supported");
        return _popcnt32(work);
    }

    static uint8_t truncate(const uint8_t &v, const size_t& n) {
        return v & c_trunc_mask_8[n];
    }
    static uint16_t truncate(const uint16_t &v, const size_t& n) {
        return v & c_trunc_mask_16[n];
    }
    static uint32_t truncate(const uint32_t &v, const size_t& n) {
        return v & c_trunc_mask_32[n];
    }
    static uint64_t truncate(const uint64_t &v, const size_t& n) {
        return v & c_trunc_mask_64[n];
    }

    static int8_t truncate(const int8_t &v, const size_t& n) {
        return truncate(uint8_t(v), n);
    }
    static int16_t truncate(const int16_t &v, const size_t& n) {
        return truncate(uint16_t(v), n);
    }
    static int32_t truncate(const int32_t &v, const size_t& n) {
        return truncate(uint32_t(v), n);
    }
    static int64_t truncate(const int64_t &v, const size_t& n) {
        return truncate(uint64_t(v), n);
    }

